app/models/client.rb

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2
---
	def self.find_name e
		self.find(e).name