app/models/employee.rb

	def self.find_employee_name e
		self.find(e).collect{|e|e.name}
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" IN (1, 2, 4, 5)