app/views/application/_visual.html.erb

SELECT "work_schedules".* FROM "work_schedules" WHERE "work_schedules"."employee_id" = $1
---
	<% emp.each do |d| %>
		<% ws=WorkSchedule.where({employee_id:d[0]}).collect{|e|e.id}.count %>

SELECT "clients".* FROM "clients" WHERE "clients"."city" = $1
---
	<% city.each do |c| %>
		<%cli=Client.where({city:c}).collect{|e|e.id}.count%>

SELECT "clients".* FROM "clients"
---
			  <% c.uniq.each do |t| %>
			  	<span class='bold-underline'><%= Client.find_name t %></span><br>

SELECT "employees".* FROM "employees"
SELECT "work_days".* FROM "work_days"
SELECT COUNT(*) FROM "clients"
SELECT COUNT(*) FROM "employees"
---
	<script type="text/javascript">
		$(document).ready(function(){
			var worksched=$('#dataEmployee').data('worksched');
			var client_city=$('#dataClient').data('clients');
			var dataArr=['emp','cli'];
		  google.charts.load('current', {'packages':['corechart']});
		  google.charts.setOnLoadCallback(drawVisualization);
		  function drawVisualization() {
		    // Some raw data (not necessarily accurate)
		    var data = new google.visualization.DataTable();

				data.addColumn('string','Employee');
		    data.addColumn('number','Days Worked');
		    data.addRows(worksched);

		    var options = {
		      title : 'Total Days Worked',
		      vAxis: {title: 'Days Worked'},
		      hAxis: {title: 'Employee'},
		      seriesType: 'bars',
		      series: {5: {type: 'line'}}
		    };